apiresult = [
    {
        'cityname' : 'Мурманск' ,
        'coords' : [
            '123123-123123',
            '123123-123123'
            '123123-123123'
            '123123-123123'
            '123123-123123'
        ]
    },
    {
        'cityname' : 'Санкт-Петербург' ,
        'coords' : [
            '123123-123123',
            '123123-123123'
            '123123-123123'
            '123123-123123'
            '123123-123123'
        ]

    },
    {
        'cityname' : 'Москва' ,
        'coords' : [
            '123123-123123',
            '123123-123123'
            '123123-123123'
            '123123-123123'
            '123123-123123'
        ]
    }
]

for city in apiresult:
    print("Город: ", city['cityname'])
    for geopoint in city["coords"]:
        print(geopoint)


cityresults = [
    {
         'h2':'Москва'
         'p'
    }
]